DataProcessors/МатрицаТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МатрицаТалантов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкаМатрицыТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаМатрицыТалантов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьМатрицуТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗанятости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗанятости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МатрицаТалантов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветаСтиляПоясняющийТекст = ЦветаСтиля.ПоясняющийТекст;
	
	ЗначенияДляЗаполнения = Новый Структура("Месяц", "Период");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если Не ЗначениеЗаполнено(Горизонт) Тогда
		Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективностиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективностиКлиентСервер");
		МодульКлючевыеПоказателиЭффективностиКлиентСервер.УстановитьПредставлениеПериодаПоДате(ЭтаФорма, "Горизонт", "Период");
	Иначе
		Горизонт = Перечисления.Периодичность.Месяц;
	КонецЕсли;
	
	ГруппаВиджетов = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ГруппыВиджетов.МатрицаТалантов");
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкаМатрицыТалантов) Тогда
		Элементы.ФормаНастройки.Видимость = Истина;
	КонецЕсли;
	
	НастроитьДоступностьПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Элементы.ГруппаПотенциал.Видимость Тогда
		ИспользоватьПотенциал = Ложь;
	КонецЕсли;
	
	Если Не Элементы.ГруппаЭффективность.Видимость Тогда
		ИспользоватьЭффективность = Ложь;
	КонецЕсли;
	
	ЗагрузитьНастройкиОтображенияТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиОтображенияТаблицы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтруктураИменРеквизитов = Новый Структура;
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаПериод", "Период");
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаПредставленияПериода", "ПериодСтрокой");
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаГоризонт", "Горизонт");
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективностиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КлючевыеПоказателиЭффективностиКлиент");
		МодульКлючевыеПоказателиЭффективностиКлиент.ВыбратьПериод(ЭтаФорма, , СтруктураИменРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективностиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КлючевыеПоказателиЭффективностиКлиент");
		МодульКлючевыеПоказателиЭффективностиКлиент.ПериодСтрокойРегулирование(ЭтаФорма, Направление, "Горизонт", "Период", "ПериодСтрокой");
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказателиСотрудников

&НаКлиенте
Процедура ПоказателиСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ПоказателиСотрудников.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Сотрудник);
	ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиСотрудниковПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПоказателиСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = ВладельцыПоказателей.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьСтрокуВладельцевПоказателей(НайденныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверкаЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПараметрыДляФормированияОтчета();
	ЗаполнитьПоказателиСотрудников();
	СформироватьФормуОтчета();
	
	Отбор = Новый Структура("УровеньСсылка", ПредопределенноеЗначение("Перечисление.УровниМатрицыТалантов.ПустаяСсылка"));
	Элементы.ФормаСотрудникиВнеМатрицы.Видимость = ПоказателиСотрудников.НайтиСтроки(Отбор).Количество() > 0;
	
	ПараметрыДанных = ЗаполнитьПараметрыФормированияОтчета(ЭтотОбъект);
	ПараметыОповещения = Новый Структура;
	ПараметыОповещения.Вставить("ПараметрыДанных", ПараметрыДанных);
	Оповестить(ОбучениеРазвитиеКлиент.ИмяСобытияУстановитьПараметрыФормыОтчета(), ПараметыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаВиджета(Команда)
	
	Элементы.ЗаголовокТаблицы.Заголовок = "";
	РаботаСВиджетамиКлиент.ОбработчикКоманды(ЭтотОбъект, Команда);

КонецПроцедуры

&НаКлиенте
Процедура СкрытьРасшифровку(Команда)
	
	Элементы.ГруппаПоказателиСотрудников.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасшифровку(Команда)
	
	ОткрытьФорму("Отчет.МатрицаТалантов.Форма",,, Ложь);
	
	ПараметрыДанных = ЗаполнитьПараметрыФормированияОтчета(ЭтотОбъект);
	ПараметыОповещения = Новый Структура;
	ПараметыОповещения.Вставить("ПараметрыДанных", ПараметрыДанных);
	Оповестить(ОбучениеРазвитиеКлиент.ИмяСобытияУстановитьПараметрыФормыОтчета(), ПараметыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВнеМатрицы(Команда)
	
	Уровень = ПредопределенноеЗначение("Перечисление.УровниМатрицыТалантов.ПустаяСсылка");
	Элементы.ГруппаПоказателиСотрудников.Видимость = Истина;

	Отбор = Новый Структура("УровеньСсылка", Уровень);
	Элементы.ПоказателиСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	Элементы.ЗаголовокТаблицы.Заголовок = НСтр("ru = 'Сотрудники вне матрицы'");
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("Обработка.МатрицаТалантов.Форма.ФормаНастроек");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьФормуОтчета()
	
	Элементы.ГруппаОтчетСРасшифровкой.Видимость = Истина;
	Элементы.ФормаПоказатьРасшифровку.Видимость = Истина;
	
	РаботаСВиджетами.УдалитьГруппуВиджетов(ЭтотОбъект);
	РаботаСВиджетами.СоздатьГруппуВиджетов(ЭтотОбъект, ГруппаВиджетов, "ГруппаВиджетыМатрицы");
	
	Элементы.ПоказателиСотрудниковПоказательЭффективности.Видимость = ИспользоватьЭффективность;
	Элементы.ПоказателиСотрудниковПоказательПотенциала.Видимость = ИспользоватьПотенциал;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиСотрудников()
	
	Если (Не ЗначениеЗаполнено(Подразделение) И Сотрудники.Количество() = 0) Или Не ЗначениеЗаполнено(Период) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПараметрыОтчета = ЗаполнитьПараметрыОбработки(ЭтотОбъект);
	Обработки.МатрицаТалантов.ДанныеПоказателейПоСотрудникам(МенеджерВременныхТаблиц, ПараметрыОтчета);
	РезультатыЗапроса = ДанныеПоказателейСотрудников(МенеджерВременныхТаблиц);
	
	ПоказателиСотрудников.Очистить();
	ДанныеУровней = РегистрыСведений.НастройкаМатрицыТалантов.НастройкиМатрицыТалантов();
	
	ВыборкаФизическоеЛицо = РезультатыЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФизическоеЛицо.Следующий() Цикл
		Выборка = ВыборкаФизическоеЛицо.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьПоказателиСотрудниковПоУровню(Выборка, ДанныеУровней);
		КонецЕсли;
	КонецЦикла;
	
	ПоказателиСотрудников.Сортировать("СуммаПоказателей Убыв, ПоказательЭффективности Убыв");
	ВладельцыПоказателей.Загрузить(РезультатыЗапроса[4].Выгрузить());
	ЗаполнитьЛегенду(ДанныеУровней);
	
КонецПроцедуры

&НаСервере
Функция ДанныеПоказателейСотрудников(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТОценкаПотенциала.Сотрудник КАК Сотрудник,
		|	ВТОценкаПотенциала.Значение / ВТОценкаПотенциала.МаксимальноеЗначение * 100 КАК ИтоговоеЗначение,
		|	ВТОценкаПотенциала.Показатель КАК ХарактеристикаПерсонала
		|ПОМЕСТИТЬ ВТОценкаПотенциалаПоХарактеристики
		|ИЗ
		|	ВТОценкаПотенциала КАК ВТОценкаПотенциала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаПотенциалаПоХарактеристики.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкаПотенциалаПоХарактеристики.ИтоговоеЗначение) / КОЛИЧЕСТВО(ВТОценкаПотенциалаПоХарактеристики.ХарактеристикаПерсонала) КАК ИтоговоеЗначение
		|ПОМЕСТИТЬ ВТОценкаПотенциалаИтог
		|ИЗ
		|	ВТОценкаПотенциалаПоХарактеристики КАК ВТОценкаПотенциалаПоХарактеристики
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкаПотенциалаПоХарактеристики.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкаЭффективности.Сотрудник КАК Сотрудник,
		|	СУММА(ВТОценкаЭффективности.УдельнаяОценкаПоказателя) КАК УдельнаяОценкаПоказателя,
		|	ВТОценкаЭффективности.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТОценкаЭффективностиИтог
		|ИЗ
		|	ВТОценкаЭффективности КАК ВТОценкаЭффективности
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкаЭффективности.Сотрудник,
		|	ВТОценкаЭффективности.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВТСотрудникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ЕСТЬNULL(ВТОценкаЭффективностиИтог.УдельнаяОценкаПоказателя, 0) КАК Эффективность,
		|	ЕСТЬNULL(ВТОценкаПотенциалаИтог.ИтоговоеЗначение, 0) КАК Потенциал,
		|	ЕСТЬNULL(ВТОценкаПотенциалаИтог.ИтоговоеЗначение, 0) + ЕСТЬNULL(ВТОценкаЭффективностиИтог.УдельнаяОценкаПоказателя, 0) КАК СуммаПоказателей,
		|	ВТСотрудникиОрганизации.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	ВТСотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСотрудникиОрганизации.ВидЗанятости КАК ВидЗанятости,
		|	ВЫБОР
		|		КОГДА ВТСотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
		|			ТОГДА 1
		|		КОГДА ВТСотрудникиОрганизации.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОценкаЭффективностиИтог КАК ВТОценкаЭффективностиИтог
		|		ПО ВТСотрудникиОрганизации.Сотрудник = ВТОценкаЭффективностиИтог.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОценкаПотенциалаИтог КАК ВТОценкаПотенциалаИтог
		|		ПО ВТСотрудникиОрганизации.Сотрудник = ВТОценкаПотенциалаИтог.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	СуммаПоказателей УБЫВ
		|ИТОГИ
		|	КОЛИЧЕСТВО(Сотрудник)
		|ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	ВТОценкиПоказателейСотрудников.ВладелецПоказателя КАК ВладелецПоказателя
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ВТОценкиПоказателейСотрудников
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОценкиПоОпросамКомпетенций.Сотрудник,
		|	ВТОценкиПоОпросамКомпетенций.ОпросПоКомпетенциям
		|ИЗ
		|	ВТОценкиПоОпросамКомпетенций КАК ВТОценкиПоОпросамКомпетенций
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОценкиПоВопросамАнкеты.Сотрудник,
		|	ВТОценкиПоВопросамАнкеты.Мероприятие
		|ИЗ
		|	ВТОценкиПоВопросамАнкеты КАК ВТОценкиПоВопросамАнкеты";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиСотрудниковПоУровню(Выборка, ДанныеУровней)
	
	НоваяСтрока = ПоказателиСотрудников.Добавить();
	НоваяСтрока.Сотрудник = Выборка.Сотрудник;
	НоваяСтрока.ПоказательЭффективности = Выборка.Эффективность;
	НоваяСтрока.ПоказательПотенциала = Выборка.Потенциал;
	НоваяСтрока.СуммаПоказателей = Выборка.СуммаПоказателей;
	
	НоваяСтрока.ПоказательЭффективностиПредставление = ПредставлениеЭффективности(Выборка.Эффективность, ДанныеУровней);
	НоваяСтрока.ПоказательПотенциалаПредставление = ПредставлениеПотенциала(Выборка.Потенциал, ДанныеУровней);
	НоваяСтрока.Позиция = Выборка.Позиция;
	
	Уровень = ОпределитьУровеньСотрудника(Выборка, ДанныеУровней);
	НоваяСтрока.УровеньСсылка = Уровень;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьУровеньСотрудника(ДанныеСотрудника, ДанныеУровней)
	
	Если ИспользоватьПотенциал И Не ЗначениеЗаполнено(ДанныеСотрудника.Потенциал) Тогда
		Возврат Перечисления.УровниМатрицыТалантов.ПустаяСсылка();
	ИначеЕсли ИспользоватьЭффективность И Не ЗначениеЗаполнено(ДанныеСотрудника.Эффективность) Тогда
		Возврат Перечисления.УровниМатрицыТалантов.ПустаяСсылка();
	КонецЕсли;
	
	Уровень = "";
	Если ДанныеСотрудника.Потенциал > ДанныеУровней.ВысокаяОценкаПотенциала Тогда
		Уровень = "1";
	ИначеЕсли ДанныеСотрудника.Потенциал >= ДанныеУровней.СредняяОценкаПотенциала Тогда
		Уровень = "2";
	Иначе
		Уровень = "3";
	КонецЕсли;
		
	Если ДанныеСотрудника.Эффективность > ДанныеУровней.ВысокаяОценкаЭффективности Тогда
		Уровень = Уровень + "A";
	ИначеЕсли ДанныеСотрудника.Эффективность >= ДанныеУровней.СредняяОценкаЭффективности Тогда
		Уровень = Уровень + "B";
	Иначе
		Уровень = Уровень + "C";
	КонецЕсли;
	
	Возврат ЗначениеПеречисленияПоИмени(Уровень);
	
КонецФункции

&НаСервере
Функция ЗначениеПеречисленияПоИмени(УровеньСтрокой)
	
	Попытка
		Возврат Перечисления.УровниМатрицыТалантов["Уровень" + УровеньСтрокой];
	Исключение
		Возврат Перечисления.УровниМатрицыТалантов.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	ЕстьОшибки = Ложь;
	Если Период = Дата(1,1,1) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить период формирования отчета'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ПериодСтрокой");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если МероприятияОценки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить мероприятия для оценки потенциала'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "МероприятияОценки");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение) И Сотрудники.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо выбрать подразделение или сотрудника'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ИспользоватьПотенциал И Не ИспользоватьЭффективность Тогда
		ТекстСообщения = НСтр("ru = 'Не выбрано не одной шкалы для построения матрицы'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Возврат Не ЕстьОшибки;
КонецФункции

&НаСервере
Процедура ЗаполнитьЛегенду(ДанныеУровней)
	
	Элементы.ДекорацияЭффективностьНизкаяПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'до%1%2'"), 
													Символы.НПП, 
													ДанныеУровней.СредняяОценкаЭффективности);
	Элементы.ДекорацияЭффективностьСредняяПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'от %1 до %2'"), 
													ДанныеУровней.СредняяОценкаЭффективности,
													ДанныеУровней.ВысокаяОценкаЭффективности);
	Элементы.ДекорацияЭффективностьВысокаяПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'от%1%2'"), 
													Символы.НПП, 
													ДанныеУровней.ВысокаяОценкаЭффективности);
	
	Элементы.ДекорацияПотенциалНизкийПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'до%1%2'"), 
													Символы.НПП, 
													ДанныеУровней.СредняяОценкаПотенциала);
	Элементы.ДекорацияПотенциалСреднийПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'от %1 до %2'"), 
													ДанныеУровней.СредняяОценкаПотенциала,
													ДанныеУровней.ВысокаяОценкаПотенциала);
	Элементы.ДекорацияПотенциалВысокийПроцент.Заголовок = СтрокаЛегендыПоШаблону(НСтр("ru = 'от%1%2'"), 
													Символы.НПП, 
													ДанныеУровней.ВысокаяОценкаПотенциала);
	
КонецПроцедуры

&НаСервере
Функция СтрокаЛегендыПоШаблону(Шаблон, Параметр1, Параметр2)

	ПараметрДляШаблона1 = ?(ТипЗнч(Параметр1) = Тип("Число"), Формат(Параметр1, "ЧДЦ=2"), Параметр1);
	ПараметрДляШаблона2 = ?(ТипЗнч(Параметр2) = Тип("Число"), Формат(Параметр2, "ЧДЦ=2"), Параметр2);
	Возврат СтрШаблон(Шаблон, Параметр1, Параметр2);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьПараметрыОбработки(Форма)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", Форма.ПериодДляРасшифровки);
	ПараметрыФормы.Вставить("МероприятияОценки", Форма.МероприятияОценкиДляРасшифровки);
	ПараметрыФормы.Вставить("Подразделение", Форма.ПодразделениеДляРасшифровки);
	ПараметрыФормы.Вставить("ВключаяПодчиненныеПодразделения", Форма.ВключаяПодчиненныеДляРасшифровки);
	ПараметрыФормы.Вставить("Горизонт", Форма.ГоризонтДляРасшифровки);
	ПараметрыФормы.Вставить("ФизическиеЛица", Форма.ФизическиеЛицаДляРасшифровки);
	ПараметрыФормы.Вставить("ИспользоватьЭффективность", Форма.ИспользоватьЭффективность);
	ПараметрыФормы.Вставить("ИспользоватьПотенциал", Форма.ИспользоватьПотенциал);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьПараметрыФормированияОтчета(Форма)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", ЗаполнитьДанныеПараметра(Форма.ПериодДляРасшифровки));
	ПараметрыФормы.Вставить("МероприятияОценки", ЗаполнитьДанныеПараметра(Форма.МероприятияОценкиДляРасшифровки));
	ПараметрыФормы.Вставить("Подразделение", ЗаполнитьДанныеПараметра(Форма.ПодразделениеДляРасшифровки));
	ПараметрыФормы.Вставить("ВключаяПодчиненныеПодразделения", ЗаполнитьДанныеПараметра(Форма.ВключаяПодчиненныеДляРасшифровки));
	ПараметрыФормы.Вставить("Горизонт", ЗаполнитьДанныеПараметра(Форма.ГоризонтДляРасшифровки));
	ПараметрыФормы.Вставить("ИспользоватьЭффективность", ЗаполнитьДанныеПараметра(Форма.ИспользоватьЭффективность));
	ПараметрыФормы.Вставить("ИспользоватьПотенциал", ЗаполнитьДанныеПараметра(Форма.ИспользоватьПотенциал));
	
	Если Форма.ФизическиеЛицаДляРасшифровки.Количество() = 0 Тогда
		ПараметрыФормы.Вставить("ФизическиеЛица", ЗаполнитьДанныеПараметра(Форма.ФизическиеЛицаДляРасшифровки));
	Иначе
		ПараметрыФормы.Вставить("ФизическиеЛица", ЗаполнитьДанныеПараметра(Неопределено));
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьДанныеПараметра(ЗначениеПараметра)
	
	ДанныеПараметра = Новый Структура("Значение, Использование", Неопределено, Ложь);
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ДанныеПараметра.Значение = ЗначениеПараметра;
		ДанныеПараметра.Использование = Истина;
	КонецЕсли;
	
	Возврат ДанныеПараметра;
	
КонецФункции

&НаСервере
Функция ПредставлениеЭффективности(Значение, ДанныеУровней)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Значение > ДанныеУровней.ВысокаяОценкаЭффективности Тогда
		ОписаниеУровня  = "высокая";
	ИначеЕсли Значение >= ДанныеУровней.СредняяОценкаЭффективности Тогда
		ОписаниеУровня = "средняя";
	Иначе
		ОписаниеУровня = "низкая";
	КонецЕсли;
	
	Возврат СтрШаблон("%1%% (%2)", Формат(Значение, "ЧДЦ=2"), ОписаниеУровня);
	
КонецФункции

&НаСервере
Функция ПредставлениеПотенциала(Значение, ДанныеУровней)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Значение > ДанныеУровней.ВысокаяОценкаПотенциала Тогда
		ОписаниеУровня  = "высокий";
	ИначеЕсли Значение >= ДанныеУровней.СредняяОценкаПотенциала Тогда
		ОписаниеУровня = "средний";
	Иначе
		ОписаниеУровня = "низкий";
	КонецЕсли;
	
	Возврат СтрШаблон("%1%% (%2)", Формат(Значение, "ЧДЦ=2"), ОписаниеУровня);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтрокуВладельцаПоказателя(МассивСтрок, ВладелецПоказателя, ИмяТипа)
	
	ОписаниеСтроки = СтрШаблон("%1 <span style=""color: ПоясняющийТекст""> (%2)</span>",
		Строка(ВладелецПоказателя), ИмяТипа);
	
	МассивСтрок.Добавить(ОписаниеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтрокуВладельцевПоказателей(НайденныеСтроки)
	
	МассивСтрокПотенциал = Новый Массив;
	МассивСтрокЭффективность = Новый Массив;
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		
		ТипВладельца = ТипЗнч(Стр.ВладелецПоказателя);
		Если ТипВладельца = Тип("СправочникСсылка.МероприятияОценкиПерсонала") Тогда
			ДобавитьСтрокуВладельцаПоказателя(МассивСтрокПотенциал, Стр.ВладелецПоказателя, "оценка 360°");
		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.ОпросыПоКомпетенциям") Тогда
			ДобавитьСтрокуВладельцаПоказателя(МассивСтрокПотенциал, Стр.ВладелецПоказателя, "опрос по компетенциям");
		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
			ДобавитьСтрокуВладельцаПоказателя(МассивСтрокЭффективность, Стр.ВладелецПоказателя, "подразделение");
		ИначеЕсли ТипВладельца = Тип("СправочникСсылка.Сотрудники") Тогда
			ДобавитьСтрокуВладельцаПоказателя(МассивСтрокЭффективность, Стр.ВладелецПоказателя, "сотрудник");
		Иначе
			ДобавитьСтрокуВладельцаПоказателя(МассивСтрокЭффективность, Стр.ВладелецПоказателя, "позиция");
		КонецЕсли;
	КонецЦикла;
	
	ШаблонДляПоказателей = "<span style=""color: ПоясняющийТекст"">%1:</span> %2%3";
	Если МассивСтрокЭффективность.Количество() > 0 Тогда
		ПараметрыЭффективностиСтрокой = СтрСоединить(МассивСтрокЭффективность, ", ");
		ПараметрЭффективности = СтрШаблон(ШаблонДляПоказателей,
			НСтр("ru = 'Набор показателей эффективности, действующих на сотрудника'"),
			ПараметрыЭффективностиСтрокой,
			Символы.ПС);
	Иначе
		ПараметрЭффективности = "";
	КонецЕсли;
	
	Если МассивСтрокПотенциал.Количество() > 0 Тогда
		ПараметрыПотенциалаСтрокой = СтрСоединить(МассивСтрокПотенциал, ", ");
		ПараметрПотенциала = СтрШаблон(ШаблонДляПоказателей,
			НСтр("ru = 'Мероприятия оценки, участвующие в расчетах показателя потенциала'"),
			ПараметрыПотенциалаСтрокой,
			"");
	Иначе
		ПараметрПотенциала = "";
	КонецЕсли;
	
	ШаблонПоказателей = СтрШаблон("%1%2", ПараметрЭффективности, ПараметрПотенциала);
	
	СтрокаВладельцыПоказателя = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ШаблонПоказателей);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметрыДляФормированияОтчета()
	
	ПериодДляРасшифровки = Период;
	МероприятияОценкиДляРасшифровки = МероприятияОценки;
	ПодразделениеДляРасшифровки = Подразделение;
	ВключаяПодчиненныеДляРасшифровки = ВключаяПодчиненные;
	ФизическиеЛицаДляРасшифровки = Сотрудники;
	ГоризонтДляРасшифровки = Горизонт;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтображенияТаблицы()
	
	Если Элементы.ГруппаПоказателиСотрудников.Видимость Тогда
		ХранилищеСистемныхНастроек.Сохранить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ОтборПоказателей", Элементы.ПоказателиСотрудников.ОтборСтрок);
		ХранилищеСистемныхНастроек.Сохранить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ЗаголовокТаблицы", Элементы.ЗаголовокТаблицы.Заголовок);
	Иначе
		ХранилищеСистемныхНастроек.Сохранить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ОтборПоказателей", "");
		ХранилищеСистемныхНастроек.Сохранить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ЗаголовокТаблицы", "");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОтображенияТаблицы()
	
	ОтборСтрок = ХранилищеСистемныхНастроек.Загрузить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ОтборПоказателей");
	ЗаголовокТаблицы = ХранилищеСистемныхНастроек.Загрузить("Обработка.МатрицаТалантов.Форма.Форма/ТекущиеДанные", "ЗаголовокТаблицы");
	Если ЗначениеЗаполнено(ОтборСтрок) Тогда
		Элементы.ГруппаПоказателиСотрудников.Видимость = Истина;
		Элементы.ПоказателиСотрудников.ОтборСтрок = ОтборСтрок;
		Элементы.ЗаголовокТаблицы.Заголовок = ЗаголовокТаблицы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьПараметров()
	
	ИспользоватьПотенциал = Истина;
	ИспользоватьЭффективность = Истина;
	
	ИспользуетсяПоказателиЭффективности = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективности = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективности");
		ИспользуетсяПоказателиЭффективности = МодульКлючевыеПоказателиЭффективности.ПрочитатьНастройкуКлючевыеПоказателиЭффективности();
	КонецЕсли;
	
	Элементы.ГруппаЭффективность.Видимость = ИспользуетсяПоказателиЭффективности;
	
	ИспользуютсяОпросы = (ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала") 
		Или ПолучитьФункциональнуюОпцию("ИспользоватьОценкуПерсонала"));
	Элементы.ГруппаПотенциал.Видимость = ИспользуютсяОпросы;
		
	Если Не ИспользуютсяОпросы И Не ИспользуетсяПоказателиЭффективности Тогда
		Элементы.ДекорацияИнформация.Заголовок = 
			НСтр("ru = 'Для формирования матрицы необходимо подключить ключевые показатели эффективности или один из методов оценки персонала'");
		Элементы.ГруппаИнформация.Видимость = Истина;
	ИначеЕсли Не ИспользуютсяОпросы Тогда
		Элементы.ДекорацияИнформация.Заголовок = 
			НСтр("ru = 'Для формирования матрицы по обеим осям необходимо подключить один из методов оценки персонала'");
		Элементы.ГруппаИнформация.Видимость = Истина;
	ИначеЕсли Не ИспользуетсяПоказателиЭффективности Тогда
		Элементы.ДекорацияИнформация.Заголовок = 
			НСтр("ru = 'Для формирования матрицы по обеим осям необходимо подключить ключевые показатели эффективности'");
		Элементы.ГруппаИнформация.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
